[ {
"西尾線": {
"新安城": 1,
"北安城": 2,
"南安城": 3,
"碧海古井": 4,
"堀内公園": 5,
"桜井": 6,
"南桜井": 7,
"米津": 8,
"桜町前": 9,
"西尾口": 10,
"西尾": 11,
"福地": 12,
"上横須賀": 13,
"吉良吉田": 14
}
}
, {
"蒲郡線": {
"吉良吉田": 1,
"三河鳥羽": 2,
"西幡豆": 3,
"東幡豆": 4,
"こどもの国": 5,
"西浦": 6,
"形原": 7,
"三河鹿島": 8,
"蒲郡競艇場前": 9,
"蒲郡": 10
},}

,{ "河和線": {
'太田川': 1,
'高横須賀': 2,
'加木屋中ノ池': 3,
'南加木屋': 4,
'八幡新田': 5,
'巽ケ丘': 6,
'白沢': 7,
'坂部': 8,
'阿久比': 9,
'植大': 10,
'半田口': 11,
'住吉町': 12,
'知多半田': 13,
'成岩': 14,
'青山': 15,
'上ゲ': 16,
'知多武豊': 17,
'富貴': 18,
'河和口': 19,
'河和': 20
}}
, { "知多新線": {
'富貴': 1,
'上野間': 2,
'美浜緑苑': 3,
'知多奥田': 4,
'野間': 5,
'内海': 6
}}

, {
"津島線・尾西線（津島～弥富）": {
"須ケ口": 1,
"甚目寺": 2,
"七宝": 3,
"木田": 4,
"青塚": 5,
"勝幡": 6,
"藤浪": 7,
"津島": 8,
"日比野": 9,
"佐屋": 10,
"五ノ三": 11,
"弥富": 12
}
}
, {
"尾西線（津島方面）": {
"津島": 1,
"町方": 2,
"六輪": 3,
"渕高": 4,
"丸渕": 5,
"上丸渕": 6,
"森上": 7,
"山崎": 8,
"玉野": 9,
"萩原": 10,
"二子": 11,
"苅安賀": 12,
"観音寺": 13,
"名鉄一宮": 14
}
}
,{
"尾西線（玉ノ井方面）": {
"名鉄一宮": 1,
"西一宮": 2,
"開明": 3,
"奥町": 4,
"玉ノ井": 5
}
}
]