[{ "愛環"  : {
 '岡崎': 1,
 '六名': 2,
 '中岡崎': 3,
 '北岡崎': 4,
 '大門': 5,
 '北野桝塚': 6,
 '三河上郷': 7,
 '永覚': 8,
 '末野原': 9,
 '三河豊田': 10,
 '新上挙母': 11,
 '新豊田': 12,
 '愛環梅坪': 13,
 '四郷': 14,
 '貝津': 15,
 '保見': 16,
 '篠原': 17,
 '八草': 18,
 '山口': 19,
 '瀬戸口': 20,
 '瀬戸市': 21,
 '中水野': 22,
 '高蔵寺': 23}
}
,{"JR東海道本線" : {
   '熱海': 1, '函南': 2, '三島': 3, '沼津': 4, '片浜': 5, 
   '原': 6, '東田子の浦': 7, '吉原': 8, '富士': 9, '富士川': 10,
   '新蒲原': 11, '蒲原': 12, '由比': 13, '興津': 14, '清水': 15,
   '草薙': 16, '東静岡': 17, '静岡': 18, '安倍川': 19, '用宗': 20,
   '焼津': 21, '西焼津': 22, '藤枝': 23, '六合': 24, '島田': 25,
   '金谷': 26, '菊川': 27, '掛川': 28, '愛野': 29, '袋井': 30,
   '御厨': 31, '磐田': 32, '豊田町': 33, '天竜川': 34, '浜松': 35,
   '高塚': 36, '舞阪': 37, '弁天島': 38, '新居町': 39, '鷲津': 40,
   '新所原': 41, '二川': 42, '豊橋': 43, '西小坂井': 44, '愛知御津': 45,
   '三河大塚': 46, '三河三谷': 47, '蒲郡': 48, '三河塩津': 49, '三ヶ根': 50,
   '幸田': 51, '相見': 52, '岡崎': 53, '西岡崎': 54, '安城': 55,
   '三河安城': 56, '東刈谷': 57, '野田新町': 58, '刈谷': 59, '逢妻': 60,
   '大府': 61, '共和': 62, '南大高': 63, '大高': 64, '笠寺': 65,
   '熱田': 66, '金山': 67, '尾頭橋': 68, '名古屋': 69, '枇杷島': 70,
   '清洲': 71, '稲沢': 72, '尾張一宮': 73, '木曽川': 74, '岐阜': 75,
   '西岐阜': 76, '穂積': 77, '大垣': 78, '荒尾': 79, '美濃赤坂': 80,
   '垂井': 81, '関ヶ原': 82, '柏原': 83, '近江長岡': 84, '醒ヶ井': 85,
   '米原': 86}
}

,{ "飯田線" : {
     '豊橋': 1,
   '豊川': 2,
   '新城': 3,
   '中部天竜': 4,
   '飯田': 5,
   '伊那市': 6
}
}
,{ "中央本線": {
   '名古屋': 1,
   '金山': 2,
   '鶴舞': 3,
   '千種': 4,
   '大曽根': 5,
   '新守山': 6,
   '勝川': 7,
   '春日井': 8,
   '神領': 9,
   '高蔵寺': 10,
   '多治見': 11,
   '土岐市': 12,
   '瑞浪': 13,
   '恵那': 14,
   '中津川': 15,
   '木曽福島': 16
}}

,{ "武豊線": {
   '大府': 1,
   '緒川': 2,
   '東浦': 3,
   '亀崎': 4,
   '半田': 5,
   '武豊': 6
}}
,{ "太多線": {
   '多治見': 1,
   '可児': 2,
   '美濃太田': 3
}}

, {"関西本線": {
   '名古屋': 1,
   '八田': 2,
   '春田': 3,
   '蟹江': 4,
   '桑名': 5,
   '四日市': 6,
   '亀山': 7
}}

, { "高山本線": {
   '岐阜': 1,
   '鵜沼': 2,
   '美濃太田': 3,
   '下呂': 4,
   '高山': 5
}}

,{ "参宮線": {
   '多気': 1,
   '伊勢市': 2
}}

, { "紀勢本線": {
   '亀山': 1,
   '津': 2,
   '松阪': 3,
   '多気': 4,
   '紀伊長島': 5,
   '尾鷲': 6,
   '熊野市': 7
}}
,{ "名松線": {
   '松阪': 1
}}

, {
"名古屋本線": {
"豊橋": 1,
"伊奈": 2,
"小田渕": 3,
"国府": 4,
"御油": 5,
"名電赤坂": 6,
"名電長沢": 7,
"本宿": 8,
"名電山中": 9,
"藤川": 10,
"美合": 11,
"男川": 12,
"東岡崎": 13,
"岡崎公園前": 14,
"矢作橋": 15,
"宇頭": 16,
"新安城": 17,
"牛田": 18,
"知立": 19,
"一ツ木": 20,
"富士松": 21,
"豊明": 22,
"前後": 23,
"中京競馬場前": 24,
"有松": 25,
"左京山": 26,
"鳴海": 27,
"本星崎": 28,
"本笠寺": 29,
"桜": 30,
"呼続": 31,
"堀田": 32,
"神宮前": 33,
"金山": 34,
"山王": 35,
"名鉄名古屋": 36,
"栄生": 37,
"東枇杷島": 38,
"西枇杷島": 39,
"二ツ杁": 40,
"新川橋": 41,
"須ケ口": 42,
"丸ノ内": 43,
"新清洲": 44,
"大里": 45,
"奥田": 46,
"国府宮": 47,
"島氏永": 48,
"妙興寺": 49,
"名鉄一宮": 50,
"今伊勢": 51,
"石刀": 52,
"新木曽川": 53,
"黒田": 54,
"木曽川堤": 55,
"笠松": 56,
"岐南": 57,
"茶所": 58,
"加納": 59,
"名鉄岐阜": 60
}
}

, { "豊川線": {
'国府': 1,
'八幡': 2,
'諏訪町': 3,
'稲荷口': 4,
'豊川稲荷': 5
}}
, {
"西尾線": {
"新安城": 1,
"北安城": 2,
"南安城": 3,
"碧海古井": 4,
"堀内公園": 5,
"桜井": 6,
"南桜井": 7,
"米津": 8,
"桜町前": 9,
"西尾口": 10,
"西尾": 11,
"福地": 12,
"上横須賀": 13,
"吉良吉田": 14
}
}
, {
"蒲郡線": {
"吉良吉田": 1,
"三河鳥羽": 2,
"西幡豆": 3,
"東幡豆": 4,
"こどもの国": 5,
"西浦": 6,
"形原": 7,
"三河鹿島": 8,
"蒲郡競艇場前": 9,
"蒲郡": 10
}
}
, { "三河線（知立～碧南）": {
'知立': 1,
'重原': 2,
'刈谷': 3,
'刈谷市': 4,
'小垣江': 5,
'吉浜': 6,
'三河高浜': 7,
'高浜港': 8,
'北新川': 9,
'新川町': 10,
'碧南中央': 11,
'碧南': 12
}}
, { "三河線（知立～猿投）": {
'知立': 1,
'三河知立': 2,
'三河八橋': 3,
'若林': 4,
'竹村': 5,
'土橋': 6,
'上挙母': 7,
'豊田市': 8,
'梅坪': 9,
'越戸': 10,
'平戸橋': 11,
'猿投': 12
}}

, { "豊田線": {
'豊田市': 1,
'梅坪': 2,
'上豊田': 3,
'浄水': 4,
'三好ケ丘': 5,
'黒笹': 6,
'米野木': 7,
'日進': 8,
'赤池': 9
}}

,{ "常滑線・空港線": {
'神宮前': 1,
'豊田本町': 2,
'道徳': 3,
'大江': 4,
'大同町': 5,
'柴田': 6,
'名和': 7,
'聚楽園': 8,
'新日鉄前': 9,
'太田川': 10,
'尾張横須賀': 11,
'寺本': 12,
'朝倉': 13,
'古見': 14,
'長浦': 15,
'日長': 16,
'新舞子': 17,
'大野町': 18,
'西ノ口': 19,
'蒲池': 20,
'榎戸': 21,
'多屋': 22,
'常滑': 23,
'りんくう常滑': 24,
'中部国際空港': 25
}}
,{ "築港線": {
'大江': 1,
'東名古屋港': 2
}}

,{ "河和線": {
'太田川': 1,
'高横須賀': 2,
'加木屋中ノ池': 3,
'南加木屋': 4,
'八幡新田': 5,
'巽ケ丘': 6,
'白沢': 7,
'坂部': 8,
'阿久比': 9,
'植大': 10,
'半田口': 11,
'住吉町': 12,
'知多半田': 13,
'成岩': 14,
'青山': 15,
'上ゲ': 16,
'知多武豊': 17,
'富貴': 18,
'河和口': 19,
'河和': 20
}}
, { "知多新線": {
'富貴': 1,
'上野間': 2,
'美浜緑苑': 3,
'知多奥田': 4,
'野間': 5,
'内海': 6
}}

, {
"津島線": {
"須ケ口": 1,
"甚目寺": 2,
"七宝": 3,
"木田": 4,
"青塚": 5,
"勝幡": 6,
"藤浪": 7,
"津島": 8,
"日比野": 9,
"佐屋": 10,
"五ノ三": 11,
"弥富": 12
}
}
, {
"尾西線（津島方面）": {
"津島": 1,
"町方": 2,
"六輪": 3,
"渕高": 4,
"丸渕": 5,
"上丸渕": 6,
"森上": 7,
"山崎": 8,
"玉野": 9,
"萩原": 10,
"二子": 11,
"苅安賀": 12,
"観音寺": 13,
"名鉄一宮": 14
}
}
,{
"尾西線（玉ノ井方面）": {
"名鉄一宮": 1,
"西一宮": 2,
"開明": 3,
"奥町": 4,
"玉ノ井": 5
}
}
, {
"竹鼻線・羽島線": {
"笠松": 1,
"西笠松": 2,
"柳津": 3,
"南宿": 4,
"須賀": 5,
"不破一色": 6,
"竹鼻": 7,
"羽島市役所前": 8,
"江吉良": 9,
"新羽島": 10
}
}
, {
"犬山線": {
"名鉄名古屋": 1,
"栄生": 2,
"東枇杷島": 3,
"下小田井": 4,
"中小田井": 5,
"上小田井": 6,
"西春": 7,
"徳重・名古屋芸大": 8,
"大山寺": 9,
"岩倉": 10,
"石仏": 11,
"布袋": 12,
"江南": 13,
"柏森": 14,
"扶桑": 15,
"木津用水": 16,
"犬山口": 17,
"犬山": 18,
"犬山遊園": 19,
"新鵜沼": 20
}
}
, {
"広見線（犬山～新可児）": {
"犬山": 1,
"富岡前": 2,
"善師野": 3,
"西可児": 4,
"可児川": 5,
"日本ライン今渡": 6,
"新可児": 7
}
}
, {
"広見線（新可児～御嵩）": {
"新可児": 1,
"明智": 2,
"顔戸": 3,
"御嵩口": 4,
"御嵩": 5
}
}
, {
"小牧線": {
"犬山": 1,
"羽黒": 2,
"楽田": 3,
"田県神社前": 4,
"味岡": 5,
"小牧原": 6,
"小牧": 7,
"小牧口": 8,
"間内": 9,
"牛山": 10,
"春日井": 11,
"味美": 12,
"味鋺": 13,
"上飯田": 14
}
}
,{
"各務原線": {
"犬山": 1,
"犬山遊園": 2,
"新鵜沼": 3,
"鵜沼宿": 4,
"羽場": 5,
"苧ケ瀬": 6,
"名電各務原": 7,
"二十軒": 8,
"三柿野": 9,
"六軒": 10,
"各務原市役所前": 11,
"市民公園前": 12,
"新那加": 13,
"新加納": 14,
"高田橋": 15,
"手力": 16,
"切通": 17,
"細畑": 18,
"田神": 19,
"名鉄岐阜": 20
}
}
,{
"瀬戸線": {
"栄町": 1,
"東大手": 2,
"清水": 3,
"尼ケ坂": 4,
"森下": 5,
"大曽根": 6,
"矢田": 7,
"守山自衛隊前": 8,
"瓢箪山": 9,
"小幡": 10,
"喜多山": 11,
"大森・金城学院前": 12,
"印場": 13,
"旭前": 14,
"尾張旭": 15,
"三郷": 16,
"水野": 17,
"新瀬戸": 18,
"瀬戸市役所前": 19,
"尾張瀬戸": 20
}
}
,{
   "東山線" : {
      "高畑": 1,
"八田": 2,
"岩塚": 3,
"中村公園": 4,
"中村日赤": 5,
"本陣": 6,
"亀島": 7,
"名古屋": 8,
"伏見": 9,
"栄": 10,
"新栄町": 11,
"千種": 12,
"今池": 13,
"池下": 14,
"覚王山": 15,
"本山": 16,
"東山公園": 17,
"星ヶ丘": 18,
"一社": 19,
"上社": 20,
"本郷": 21,
"藤が丘": 22
   }
},
{"名港線" : {
"金山": 1,
"日比野": 2,
"六番町": 3,
"東海通": 4,
"港区役所": 5,
"築地口": 6,
"名古屋港": 7
}},
{
   "名城線" : {
"名古屋大学": 1,
"本山": 2,
"自由ヶ丘": 3,
"茶屋ヶ坂": 4,
"砂田橋": 5,
"ナゴヤドーム前矢田": 6,
"大曽根": 7,
"平安通": 8,
"志賀本通": 9,
"黒川": 10,
"名城公園": 11,
"名古屋城": 12,
"久屋大通": 13,
"栄": 14,
"矢場町": 15,
"上前津": 16,
"東別院": 17,
"金山": 18,
"西高蔵": 19,
"熱田神宮西": 20,
"熱田神宮伝馬町": 21,
"堀田": 22,
"妙音通": 23,
"新瑞橋": 24,
"瑞穂運動場東": 25,
"総合リハビリセンター": 26,
"八事": 27,
"八事日赤": 28
}
},
{
   "飯田線" : {
"平安通": 1,
"上飯田": 2
}
},
{
   "鶴舞線" : {
      "上小田井": 1,
"庄内緑地公園": 2,
"庄内通": 3,
"浄心": 4,
"浅間町": 5,
"丸の内": 6,
"伏見": 7,
"大須観音": 8,
"上前津": 9,
"鶴舞": 10,
"荒畑": 11,
"御器所": 12,
"川名": 13,
"いりなか": 14,
"八事": 15,
"塩釜口": 16,
"植田": 17,
"原": 18,
"平針": 19,
"赤池": 20
   }
},
{
"太閤通": 1,
"名古屋": 2,
"国際センター": 3,
"丸の内": 4,
"久屋大通": 5,
"高岳": 6,
"車道": 7,
"今池": 8,
"吹上": 9,
"御器所": 10,
"桜山": 11,
"瑞穂区役所": 12,
"瑞穂運動場西": 13,
"新瑞橋": 14,
"桜本町": 15,
"鶴里": 16,
"野並": 17,
"鳴子北": 18,
"相生山": 19,
"神沢": 20,
"徳重": 21
}
]